{
    "broadArea": {
        "name": "Electrical Engineering",
        "link": "https://www.vlab.co.in/broad-area-electrical-engineering",
        "code": "EE"
    },
    "lab": "Power Electronics - 1",
    "lab_display_name": "Power Electronics - 1",
    "phase": "3-ext",
    "collegeName": "IITD",
    "baseUrl": "pe1-iitd.vlabs.ac.in",
    "introduction": "<img src='./images/gifa.gif' alt='Introduction image' /><br>This virtual laboratory explores power electronics through hands-on experiments and performance analysis via virtual platform. The aim is to provide a hassle-free learning experience to impart technical skills without needing costly instrumentation, equipment,power supplies and auxiliary driving systems. This will prepare students for understanding the real-world applications in the area of power conversion using Power Electronic Converters and their control.<br><br>Here, students will also get the opportunity to understand the theory through practice via virtual platform. In first experiment, three important controllable switching devices (SCR,IGBT and MOSFET) are introduced along with easy to understand brief descriptions. Later stage involves the characteristics generation of these devices on the virtual digital storage oscilloscope. Next, experiments pertaining to the performance measurement and analysis of the single-phase and three-phase AC-DC bridge rectifiers (both uncontrolled and controlled) are planned to introduce the students to the fundamental principles of AC to DC conversion. To demonstrate the DC - DC conversion, two different virtual experiments are then framed.The first one is non-isolated DC-DC boost converter which demonstrates the stepping-up of voltage magnitude, while the second experiment is transformer isolated converter, i.e. flybackDC-DC converter. In these experiments, students will be able to understand the fundamental principles of realizing the variable DC voltage magnitudes from a fixed DC voltage supply.Further, they will be able to create various testing conditions and then display the performance characteristics in the form of plots and bar graphs. Next, two inverter experiments deal with AC power control through pulse width modulation (PWM). Here, students will be able to visualize DC to AC conversion. The introduced IGBT inverter’s functionality is to emulate single-phase as well as three-phase AC voltages and their PWM control is to realize close to sinusoidal waveforms. Inverter performance assessment is then done through visualization of bar-charts of harmonic profile and total harmonic distortion (THD). These experiments aim at providing practical insights into the operation and control of harmonics through suitable PWM strategies. Finally, students are advised to save the observations generated at the end of each stage of all the experiments. These will help in offline analysis for better understanding. <style>table, th, td {border: 1px solid black;border-collapse: collapse;}</style><br><table style='width:50%; margin: auto;'><tr><th style='font-size: 20px; color: #3b5998;'>Principal Investigators/Laboratory Developers</th></tr></table><table style='width:50%; margin: auto;'><tr><th>Prof. Amit Kumar Jain <br>Dept. of Electrical Engineering<br>IIT Delhi<br>Email: amitjain@ee.iitd.ac.in</th><th>Prof. M. Veerachary <br>Dept. of Electrical Engineering<br>IIT Delhi<br>Email: amitjain@ee.iitd.ac.in</th></tr></table><br><table style='width:50%; margin: auto;'><tr><th style='font-size: 20px; color: #3b5998;'>Team of Research Scholars/Technical Content Organizers</th></tr></table><table style='width:50%; margin: auto;'><tr> <th> <br>1) Ms. Akankshi Trivedi <br><br> 2) Ms. Poorna Sen<br><br></th><th><br>3) Ms. Utkarsha Dey <br><br> 4) Mr. Rahul Kumar Garg<br><br></th> </tr></table><table style='width:50%; margin: auto;'><tr><th>Dept. of Electrical Engineering <br>IIT Delhi <br>Hauz Khas New Delhi – 110016, India</th></tr></table><br><br>",
    "experiments": [
        {
            "name": "Characteristics of controlled switching power devices. (a) SCR (b) MOSFET (c) IGBT",
            "short-name": "controlled-switching",
            "repo": "https://github.com/virtual-labs/exp-controlled-switching-power-devices-iitd",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Performance measurement and analysis of single phase AC-DC uncontrolled bridge rectifier",
            "short-name": "single-phase-uncontrolled",
            "repo": "https://github.com/virtual-labs/exp-single-phase-uncontrolled-bridge-rectifier-iitd",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Performance measurement and analysis of single phase AC-DC controlled bridge rectifier",
            "short-name": "single-phase-controlled",
            "repo": "https://github.com/virtual-labs/exp-single-phase-controlled-bridge-rectifier-iitd",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Performance measurement and analysis of three phase AC-DC uncontrolled bridge rectifiers",
            "short-name": "three-phase-uncontrolled",
            "repo": "https://github.com/virtual-labs/exp-three-phase-uncontrolled-bridge-rectifier-iitd",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Performance measurement and analysis of non-isolated DC-DC boost converter",
            "short-name": "non-isolated-boost-converter",
            "repo": "https://github.com/virtual-labs/exp-non-isolated-boost-converter-iitd",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Performance measurement and analysis of single phase AC voltage controller",
            "short-name": "single-phase-voltage-controller",
            "repo": "https://github.com/virtual-labs/exp-single-phase-voltage-controller-iitd",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Performance measurement and analysis of three phase AC-DC Controlled bridge rectifiers",
            "short-name": "three-phase-controlled-bridge",
            "repo": "https://github.com/virtual-labs/exp-three-phase-controlled-bridge-rectifiers-iitd",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Single phase IGBT inverter under sinusoidal PWM control",
            "short-name": "single-phase-sinusoidal-pwm",
            "repo": "https://github.com/virtual-labs/exp-single-phase-sinusoidal-pwm-control-iitd",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Three phase IGBT inverter under sinusoidal PWM control",
            "short-name": "three-phase-sinusoidal-pwm",
            "repo": "https://github.com/virtual-labs/exp-three-phase-sinusoidal-pwm-control-iitd",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Performance measurement and analysis of isolated DC-DC flyback converter",
            "short-name": "isolated-flyback-converter",
            "repo": "https://github.com/virtual-labs/exp-isolated-flyback-converter-iitd",
            "tag": "v1.0.0",
            "deploy": true
        }
    ],
    "targetAudience": {
        "UG": [
            "Under Graduate students of B.E/B.Tech – (Electrical/ Electronics/Electrical Instrumentation and Allied Engineering streams)"
        ],
        "PG": [
            "Post Graduate students of M.E/M.S/M.Tech (Power Electronics/ Power Electronics and Drives/ Industrial Electronics/ Power and Industrial Drives/ Allied Engineering streams)"
        ]
    },
    "objective": "The objective of this lab is to perform experiments to firstly understand the various power electronic switching devices, followed by the power conversion schemes using power electronics circuits: <br>AC - DC Conversion <br>DC - DC Conversion<br>DC - AC Conversion<br>AC - AC Conversion",
    "courseAlignment": {
        "description": "",
        "universities": [
            "Dept. of Electrical Engineering, National Institute of Technology Warangal",
            "Dept. of Electrical Engineering, National Institute of Technology Calicut",
            "Dept. of Electrical Engineering, National Institute of Technology Hamirpur",
            "Dept. of Electrical Engineering, National Institute of Technology Kurkshetra",
            "Dept. of Electrical Engineering, National Institute of Technology Warangal",
            "JNT University",
            "VR Siddhartha Engineering College"
        ]
    }
}
