{
  "broadArea": {
    "name": "Electrical Engineering",
    "link": "https://www.vlab.co.in/broad-area-electrical-engineering",
    "code": "EE"
  },
  "lab": "Power Electronics - 1",
  "lab_display_name": "Power Electronics – 1",
  "phase": "3-ext",
  "collegeName": "IITD",
  "baseUrl": "pe1-iitd.vlabs.ac.in",
  "introduction": "<img src='./assets/gifa.gif' alt='vlabs logo'><br>Power electronics is the basis for attainment of efficient and reliable power supply system.The power electronic circuits operation along with suitable control mechanism is crucial in powering all electronic circuits including integrated circuits (ICs), ICT equipment, LAN, smartphones, consumer electronic systems, computers and all engineering systems needing electrical power for their functioning. Also, these power electronic systems find applications in wide variety of engineering systems used in transportation, aerospace, defence, advanced automotive systems, bio-medical equipment, etc,.<br><br> In this virtual lab course students will gain a comprehensive understanding of basic power electronics subject. Each experiment includes a brief theoretical foundation followed by the main virtual experiment designed to emulate the actual experimental environment as closely as possible. Currently, this repository composed with 10 experiments. The first two experiments deal with the tracing of various characteristics of high frequency switching devices MOSFET and IGBT. Next two experiments cover the topic of single phase controlled AC-DC rectifiers with different loads and filter structures. The switching action transforms the input supply and this phenomenon can easily be visualized by the students by plotting various truncated voltage and current waveforms at different stages. This is followed by testing the rectifiers performance upon inclusion of filters (i.e. ripple reduction and smoothening of these waveforms).<br><br>Subsequently, three experiments pertaining to DC-DC conversion are formulated wherein students are able to understand easily the basic bucking and boosting of voltages. These two experiments are framed with non-isolated topologies while the third experiment is on isolated push-pull converter. In all these virtual experiments, various voltage and current waveforms for different supply input voltages and duty cycles need to be plotted. In addition to voltage gain variation, the effect of load and other parameters like duty ratio on the efficiency and component stress are displayed graphically. The last two experiments essentially deal with the realization of controllable AC voltage from the given utility AC supply (or) DC Battery source. The final experiment is the analysis of DC-AC single phase IGBT inverter controlled using various PWM techniques. Provision is given to export all the observations (*.pdf format) including the plots and bar graphs at the end of each stage of all the experiments.These recorded observations are useful for critical analysis in offline mode as per the student convenience.",
  "experiments": [
    {
      "name": "Characteristics of controlled switching power devices. (a) SCR (b) MOSFET (c) IGBT",
      "short-name": "controlled-switching",
      "repo": "https://github.com/virtual-labs/exp-controlled-switching-power-devices-iitd",
      "tag": "v1.0.1",
      "deploy": true
    },
    {
      "name": "Performance measurement and analysis of single phase AC-DC uncontrolled bridge rectifier",
      "short-name": "single-phase-uncontrolled",
      "repo": "https://github.com/virtual-labs/exp-single-phase-uncontrolled-bridge-rectifier-iitd",
      "tag": "v1.0.1",
      "deploy": true
    },
    {
      "name": "Performance measurement and analysis of single phase AC-DC controlled bridge rectifier",
      "short-name": "single-phase-controlled",
      "repo": "https://github.com/virtual-labs/exp-single-phase-controlled-bridge-rectifier-iitd",
      "tag": "v1.0.1",
      "deploy": true
    },
    {
      "name": "Performance measurement and analysis of three phase AC-DC uncontrolled bridge rectifiers",
      "short-name": "three-phase-uncontrolled",
      "repo": "https://github.com/virtual-labs/exp-three-phase-uncontrolled-bridge-rectifier-iitd",
      "tag": "v1.0.1",
      "deploy": true
    },
    {
      "name": "Performance measurement and analysis of non-isolated DC-DC boost converter",
      "short-name": "non-isolated-boost-converter",
      "repo": "https://github.com/virtual-labs/exp-non-isolated-boost-converter-iitd",
      "tag": "v1.0.1",
      "deploy": true
    },
    {
      "name": "Performance measurement and analysis of single phase AC voltage controller",
      "short-name": "single-phase-voltage-controller",
      "repo": "https://github.com/virtual-labs/exp-single-phase-voltage-controller-iitd",
      "tag": "v1.0.1",
      "deploy": true
    },
    {
      "name": "Performance measurement and analysis of three phase AC-DC Controlled bridge rectifiers",
      "short-name": "three-phase-controlled-bridge",
      "repo": "https://github.com/virtual-labs/exp-three-phase-controlled-bridge-rectifiers-iitd",
      "tag": "v1.0.1",
      "deploy": true
    },
    {
      "name": "Single phase IGBT inverter under sinusoidal PWM control",
      "short-name": "single-phase-sinusoidal-pwm",
      "repo": "https://github.com/virtual-labs/exp-single-phase-sinusoidal-pwm-control-iitd",
      "tag": "v1.0.1",
      "deploy": true
    },
    {
      "name": "Three phase IGBT inverter under sinusoidal PWM control",
      "short-name": "three-phase-sinusoidal-pwm",
      "repo": "https://github.com/virtual-labs/exp-three-phase-sinusoidal-pwm-control-iitd",
      "tag": "v1.0.1",
      "deploy": true
    },
    {
      "name": "Performance measurement and analysis of isolated DC-DC flyback converter",
      "short-name": "isolated-flyback-converter",
      "repo": "https://github.com/virtual-labs/exp-isolated-flyback-converter-iitd",
      "tag": "v1.0.1",
      "deploy": true
    }
  ],
  "targetAudience": {
    "UG": [" B.E/B.Tech – (Electrical/ Electronics/Electrical Instrumentation and Allied Engineering streams"],
    "PG": ["M.E/M.S/M.Tech (Power Electronics/ Power Electronics and Drives/ Industrial Electronics/ Power and Industrial Drives/ Allied Engineering streams"]
  },
  "objective": "To supplement the Theory Course of Power Electronics with Simulation and Laboratory experiments.",
  "courseAlignment": {
    "description": "",
    "universities": [
      "Dept. of Electrical Engineering, National Institute of Technology Warangal",
      "Dept. of Electrical Engineering, National Institute of Technology Calicut",
      "Dept. of Electrical Engineering, National Institute of Technology Hamirpur",
      "Dept. of Electrical Engineering, National Institute of Technology Kurkshetra",
      "Dept. of Electrical Engineering, National Institute of Technology Warangal",
      "JNT University",
      "VR Siddhartha Engineering College"
    ]
  }
  
}
